"""Snapshot POM """

from playwright.sync_api import Page
from pages.base_page import BasePage

class SnapPage(BasePage):
    # ============================================================
    # TEXT / SELECTOR (텍스트 & 셀렉터 상수)
    # ============================================================

    def __init__(self, page: Page):
        super().__init__(page)
        self.page = page

    # ============================================================
    # PROPERTIES
    # ============================================================ 


    # ============================================================
    # ACTIONS
    # ============================================================